let age = prompt('Якого ти року народження?');
if (age === null) {
    alert('Шкода, що Ви не захотіли ввести свою дату народження')
} else if (age !== null) {
    age = 2023 - age 
}

// _________________________________________________
let city = prompt('В якому місті ти живеш?');

if (city === null) {
    alert('Шкода, що Ви не захотіли ввести місто')
} else if (city !== null) {
    switch (city) {
        case 'Київ':
        case 'київ':
          city = 'Ти живеш у столиці України.';
        break;
        case 'Лондон':
        case 'лондон':
          city = 'Ти живеш у столиці Англії.';
        break;
        case 'Вашингтон':
        case 'вашингтон':
          city = 'Ти живеш у столиці США.';
        break;
         
        default:
           city = 'Ти живеш у місті ' +city+ '. ';
          break;
       } 
}
//______________________________________________________
let sport = prompt('Який в тебе олюблений вид спорту?');

if (sport === null) {
    alert('Шкода, що Ви не захотіли ввести вид спорту')
} else if (sport !== null) {
    switch (sport) {
        case 'Футбол':
        case 'футбол':
          sport = 'Круто! Хочеш стати як Зідан?'
        break;
        case 'Баскетбол':
        case 'баскетбол':
          sport = 'Круто! Хочеш стати як Майкл Джордан?'
        break;
        case 'Теніс':
        case 'теніс':
          sport = 'Круто! Хочеш стати як Серена Уильямс?'
        break;
         
        default:
           sport = 'Ооо!' +sport+ ' - це круто!'
          break;
       }
}
//_____________________________________________________

alert('Тобі '+ age + ' років.\n' + city + '\n' + sport);


